paulusTecnion/uberlogger-stm32/Core/Src/main.c
	  }
}




void HAL_ADC_ConvHalfCpltCallback(ADC_HandleTypeDef* hadc)
{

//		HAL_StatusTypeDef ret;
		adc_is_half = 1;
		gpio_result_write_ptr = 0;
		time_result_write_ptr = 0;
		tim3_counter=0;
		// Half way we have the pointers start at the beginning
		if (READ_BIT(spi_ctrl_state,SPI_CTRL_SENDING))
		{
			overrun = 1;
			return;
		}
		spi_ctrl_send((uint8_t*)spi_msg_1_ptr, sizeof(spi_msg_1_t));

//		ret= HAL_SPI_Transmit_DMA(&hspi1, (uint8_t*)spi_msg_1_ptr,   sizeof(spi_msg_1_t));
//		if (ret == HAL_OK)
//			HAL_GPIO_WritePin(STM_DATA_RDY_GPIO_Port, STM_DATA_RDY_Pin, GPIO_PIN_SET);


}

void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc)
{

//		HAL_StatusTypeDef ret;
		adc_is_half = 0;
		gpio_result_write_ptr = 0;
		time_result_write_ptr = 0;
		tim3_counter=0;

		if (READ_BIT(spi_ctrl_state,SPI_CTRL_SENDING))
		{
			overrun = 1;
			return;
		}
		// At the last ADC sample, we have to send data from half-way the data_buffer size.

//		spi_ctrl_send((uint8_t*)spi_msg_2_ptr, sizeof(spi_msg_2_t));
		spi_ctrl_send((uint8_t*)spi_msg_2_ptr, sizeof(spi_msg_2_t));
//		if (ret == HAL_OK)


}

void HAL_ADC_ErrorCallback(ADC_HandleTypeDef *hadc)
{

}

void HAL_GPIO_EXTI_Rising_Callback(uint16_t GPIO_Pin)
{
	if (GPIO_Pin == STM_ADC_EN_Pin)
	{
			logging_en = 1;
	}
}

void HAL_GPIO_EXTI_Falling_Callback(uint16_t GPIO_Pin)
{
	if (GPIO_Pin == STM_ADC_EN_Pin)
	{
		//HAL_SPI_DMAStop(&hspi1);

		logging_en = 0;

	}
}


/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_SPI1_Init();
  MX_ADC1_Init();
  MX_TIM3_Init();
  MX_RTC_Init();
  MX_TIM14_Init();
  /* USER CODE BEGIN 2 */

  // Set MISO pin drive strenght to High speed (bit 8 and 9 = '10' (bit 9 = 1))
  GPIOB->OSPEEDR |= (0x0200);

  // Enable TIM1 interrupt
//  TIM1->DIER |= TIM_DIER_UIE;
//  NVIC_EnableIRQ(TIM1_BRK_UP_TRG_COM_IRQn);

  HAL_ADCEx_Calibration_Start(&hadc1);
  // Backup current adc settings
  hadc1_bak = hadc1;

  spi_msg_1_ptr->startByte[0] = 0xFF;
  spi_msg_1_ptr->startByte[1] = 0xFF;
  spi_msg_2_ptr->stopByte[0]= 0xFF;
  spi_msg_2_ptr->stopByte[1]= 0xFF;


/*  HAL_NVIC_EnableIRQ(SysTick_IRQn);
  SCB->VTOR = FLASH_BASE;*/
//  HAL_InitTick(1);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
	  spi_ctrl_loop();
//	  Config_Handler();


	  switch(MainState)
	  {
	  	  case MAIN_LOGGING:
			  // Doing nothing
			  if (!logging_en || overrun)
			  {
				  if (overrun)
				  {
					  HAL_GPIO_WritePin(DATA_OVERRUN_GPIO_Port , DATA_OVERRUN_Pin, SET);
				  }
				  overrun =0;
				  HAL_TIM_Base_Stop_IT(&htim3);
				  HAL_ADC_Stop_DMA(&hadc1);
				  // Set ADC to single conversion measure mode
				  NextState = MAIN_IDLE;
			  }
			  break;

		  case MAIN_IDLE:
			  if (logging_en && spi_ctrl_isIdle())
			  {
				  spi_ctrl_receive_abort();
				  HAL_GPIO_WritePin(DATA_OVERRUN_GPIO_Port , DATA_OVERRUN_Pin, RESET);
				  // Make sure we have the original ADC config put in place
				   hadc1 = hadc1_bak;
				  // Reinit ADC
				  ADC_Reinit();

				  // Start TIM3 and DMA conversion
				  HAL_TIM_Base_Start_IT(&htim3);
				  HAL_ADC_Start_DMA(
						  &hadc1,
						  (uint32_t*)(spi_msg_1_ptr->adcData),
						  ADC_BUFFERSIZE_SAMPLES);

				  NextState = MAIN_LOGGING;
			  } else  {
				  // Check for events

				  if (spi_ctrl_msg_received())
				  {
					spi_cmd_t * cmd = (spi_cmd_t*)&cmd_buffer;
					spi_cmd_t resp;
					  switch(cmd->command)
					  {

						  case STM32_CMD_SETTINGS_MODE:
							  resp.command = STM32_CMD_SETTINGS_MODE;
							  resp.data = CMD_RESP_OK;
					//			  if (HAL_SPI_Send_cmd(STM32_CMD_SETTINGS_MODE, CMD_RESP_OK) == HAL_OK)
							  if (spi_ctrl_send((uint8_t*)&resp, sizeof(resp)) == HAL_OK)
							  {
								  NextState = MAIN_CONFIG;
							  }

						  break;

						  case STM32_CMD_SINGLE_SHOT_MEASUREMENT:

							  resp.command = STM32_CMD_SINGLE_SHOT_MEASUREMENT;
							  resp.data = CMD_RESP_OK;
					//			  if (HAL_SPI_Send_cmd(STM32_CMD_SINGLE_SHOT_MEASUREMENT, CMD_RESP_OK) == HAL_OK)
							  if (spi_ctrl_send((uint8_t*)&resp, sizeof(resp)) == HAL_OK)
							  {
								  NextState = MAIN_SINGLE_SHOT;
							  }
							  break;

						  case CMD_NOP:
					//			  HAL_SPI_Send_cmd(CMD_RESP_OK, CMD_NOP);
							  resp.command = CMD_NOP;
							  resp.data = CMD_RESP_OK;
							  spi_ctrl_send((uint8_t*)&resp, sizeof(resp));
							  break;

						  default:
					//			  HAL_SPI_Send_cmd(CMD_RESP_NOK, CMD_UNKNOWN);
							  resp.command = CMD_NOP;
							  resp.data = CMD_RESP_NOK;
							  spi_ctrl_send((uint8_t*)&resp, sizeof(resp));

					  }

				  }
				  // No event occured, check for SPI messages
				  else if (spi_ctrl_isIdle())
				  {
					  spi_ctrl_receive(cmd_buffer, sizeof(spi_cmd_t));
				  }
			  }
			  break;

		  case MAIN_CONFIG:

			  if (  main_exit_config )
			  {
				  NextState = MAIN_IDLE;
				  main_exit_config = 0 ;
				  break;
			  } else if (spi_ctrl_msg_received())
			  {
				// Forward the message to the config handler
				Config_Handler((spi_cmd_t*)cmd_buffer);
				break;
			  }
			  // No event occurred, check for SPI messages
			  else if (spi_ctrl_isIdle())
			  {
				  spi_ctrl_receive(cmd_buffer, sizeof(spi_cmd_t));
			  }
			  break;

		  case MAIN_SINGLE_SHOT:
		  {

			   htim3_bak = htim3;
			  // Set timer to 100Hz
			  Config_Set_Sample_freq(ADC_SAMPLE_RATE_100Hz);

